# Homeworks in Python

# Задача 2: Найдите сумму цифр трехзначного числа.
def summ_of_three_numbers(a, b, c):
    print("Task №2")
    print("Summ of three numbers: ", a + b + c)


# summ_of_three_numbers(1, 2, 3)

